{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<p>Designed the website to be modern. Re-touched the classic wordmark to bring it a sharper definition. Created a custom theme using Understrap as a boilerplate to update the website and create a modern platform for the client to update easily and drive online traffic. The site is designed to be easy to use but also have quick-information for people who are looking for a trustworthy mechanic.</p>","frontmatter":{"title":"Kingsgate Automotive","date":"01/08/2018","url":"http://www.kingsgateauto.com","bannerurl":"http://res.cloudinary.com/leemulvey/image/upload/v1515544024/Portfolio/kingsgate-portfolio.png"},"fields":{"slug":"/kingsgateauto/"}}},{"node":{"html":"<p>Started at the 2018 CivicTech YYC Hackathon, ArtYYC is an Android/iOS app developed in React Native geared towards enhancing the art discovery experience in Calgary, Alberta. Using predefined and collected datasets, we render art locations and information to an interactive mobile map that allows for easy discovery of local, undocumented, corporate and urban guerilla art. In addition, after launch of the alpha, a social aspect will continue development that will encourage crowd-sourcing\ninformation about unknown art in the city. </p>","frontmatter":{"title":"ArtYYC","date":"03/23/2018","url":"http://www.artyyc.ca","bannerurl":"http://res.cloudinary.com/leemulvey/image/upload/v1515544024/Portfolio/artyyc-banner.png"},"fields":{"slug":"/artyyc/"}}},{"node":{"html":"<p>Harnessed the familiarity of the Wordpress platform with the Reactive, fast and declarative nature of React to create a new gamified platform for learning Ditidaht–an Indigenous language that has only six fluent speakers today-all of whom are in their 70's and 80's. We used React to create interactive and memorable exercises that help students learn and apply concepts of the language in a fun way. The work for this project is ongoing.</p>","frontmatter":{"title":"Ditidaht","date":"08/23/2018","url":"http://www.learnditidaht.ca","bannerurl":"https://res.cloudinary.com/leemulvey/image/upload/v1541645467/Portfolio/diti-banner.png"},"fields":{"slug":"/learnditidaht/"}}}]}}}